{
    "homepage": {
        "image_carousell_1_l": "/images/homepage/carousell_1_l_en.png",
        "image_carousell_1_s": "/images/homepage/carousell_1_s_en.png",
        "image_carousell_2_l": "/images/homepage/carousell_2_l_en.jpeg",
        "image_carousell_2_s": "/images/homepage/carousell_2_s_en.jpeg",
        "image_carousell_3_l": "/images/homepage/carousell_3_l_en.jpeg",
        "image_carousell_3_s": "/images/homepage/carousell_3_s_en.jpeg",
        "image_carousell_4_l": "/images/homepage/carousell_4_l_en.jpeg",
        "image_carousell_4_s": "/images/homepage/carousell_4_s_en.jpeg",
        "image_carousell_5_l": "/images/homepage/carousell_5_l_en.jpeg",
        "image_carousell_5_s": "/images/homepage/carousell_5_s_en.jpeg",
        "image_contact_us":"/images/homepage/contact_us.jpg",
        "contact_us_title": "Contact Us",
        "contact_us_subtitle": "We provide you the repair service and technical support.",
        "contact_us_button": "CONTACT NOW"
    },
    "navbar": {
        "navbar_products":"Product",
        "navbar_quality":"Quality",
        "navbar_support":"Support",
        "navbar_about":"About",
        "navbar_where":"Where to Buy",
        "items": {
            "vaio_sx14": "New VAIO SX14",
            "vaio_se14_2021": "VAIO SE14 2021",
            "vaio_sx12": "VAIO SX12",
            "vaio_a12": "VAIO A12",
            "vaio_s11": "VAIO S11",
            "vaio_s13": "VAIO S13",
            "service_center": "Service Center",
            "warranty": "Warranty",
            "repair_terms_and_conditions": "Repair Terms & Conditions",
            "about_vaio": "About VAIO",
            "contact_us": "Contact Us"
        }
    },
    "footer": {
        "e_store": "eStore",
        "product": "Product",
        "quality": "Quality",
        "azumino_finish": "Azumino Finish",
        "quality_tests": "Quality Tests",
        "support": "Support",
        "service_center": "Service Center",
        "warranty": "Warranty",
        "repair_terms_and_conditions": "Repair Terms & Conditions",
        "about_vaio": "About VAIO",
        "where_to_buy": "Where To Buy",
        "contact_us": "Contact Us",
        "follow_us": "FOLLOW US!",
        "privacy_header": "Privacy Policy & Terms of Use Notice",
        "privacy_paragraph_1": "All support information on this site is limited to VAIO’s personal computer products manufactured and sold by NEXSTGO. If your PC was manufactured by Sony Corporation, please visit Sony’s website for support.",
        "privacy_paragraph_2": "Intel, the Intel logo, and Intel Core are trademarks of Intel Corporation in the U.S. and/or other countries. The use of the “VAIO” trademark is by permission of and subject to license with VAIO Corporation.",
        "privacy_nexstgo": "© 2024 Nexstgo Company Ltd"
    },
    "support": {
        "image_support_banner": "/images/support/support.png",
        "support_header": "Support",
        "service_center": "Service Center",
        "customer_service": "Customer Service (HK)",
        "location": "-",
        "time": "-",
        "phone_number": "(Email reservation is required)",
        "email": "supporthk@hk.vaio.com",
        "warranty": "Warranty",
        "warranty_subheader_1":"Nexstgo Company Limited (“NEXSTGO”) Limited Warranty for VAIO Notebook Computer Devices (Only applicable to “VAIO” series)",
        "warranty_text_1": "NEXSTGO provides limited warranty period, twelve (12) months, for customer who has free carry-in repair service, including parts and labour for the notebook computer.",
        "warranty_text_2": "The limited warranty covers the battery pack within twelve (12) months of the original purchase date as shown on the original proof of purchase.",
        "warranty_text_3": "The limited warranty covers the power adaptor within twelve (12) months of the original purchase date as shown on the original proof of purchase.",
        "warranty_text_4": "NEXSTGO accepts goods exchange (except for displayed products) after verified by Repair Service Centre with more than five (5) defective pixels within seven (7) calendar days from original date of purchase. Goods returned to dealer must be in original packing, with accessories and proof of purchase.",
        "warranty_text_5": "NEXSTGO accepts goods exchange (except for displayed products) after verified by Repair Service Centre with hardware failure within seven (7) calendar days from original date of purchase. Goods returned to dealer must be in original packing, with accessories and proof of purchase.",
        "warranty_text_6": "Customer must present the original proof of purchase to NEXSTGO Repair Service Centre for verification when warranty service is rendered. Service fee will be charged if any one of the documents cannot be produced. NEXSTGO reserves the right to refuse services to anyone if original proof of purchase cannot be produced.",
        "warranty_text_7": "Customer is responsible for delivering and collecting the Computer at his/her own cost when carry-in repaired service is requested. For courier pick-up repair service, customer is responsible for the for packaging of the computer. Please ensure your laptop is well protected, courier might reject any inadequate packaging. If the computer is damaged during transportation, customer will be responsible for half of the extra repair cost.",
        "warranty_text_8": "This limited warranty covers hardware only. Software, accessories such as connection cables, power cables and CD/DVD are excluded in the warranty.",
        "warranty_text_9": "NEXSTGO is not obligated to re-install preloaded software. Handling fee will be charged for the request of re-installation service.",
        "warranty_text_10": "The limited warranty service is offered to the computer for defect(s) caused undernormal usage, in the judgement of NEXSTGO's technician. The warranty is nulland void under the following circumstances if:",
        "warranty_text_10_i": "the computer has been damaged or has failed due to accident, cabinets/cosmetic damage, abuse, liquid spill or submersion, neglect, misuse, unauthorised modification, extreme environment, extreme physical or electrical stress or interference, fluctuation or surges of electrical power, lightning, static electricity, fire, acts of God or other external causes;",
        "warranty_text_10_ii": "the computer, included hardware and preloaded software, has been modified, altered and/or repaired by persons other than NEXSTGO and/or NEXSTGO's authorised service centres;",
        "warranty_text_10_iii": "the serial number has been altered, effaced or removed;",
        "warranty_text_11": "NEXSTGO may use parts or products that are new or refurbished and equivalent to new in performance and reliability in servicing your product.",
        "warranty_text_12": "Any detective part which has been replaced, shall be NEXSTGO's property.",
        "warranty_text_13": "Customer should backup his/her own hard disk contents of his/her own accord before repair. NEXSTGO shall not provide hard disk backup service.",
        "warranty_text_14": "In case of repair, hard disk content may be destroyed and customer will not be informed in advance. NEXSTGO shall not be liable for any data, records or program lost due to repair.",
        "warranty_text_15": "The warranty offer may be subject to change depending on the promotion. Please refer to the relevant promotion details.",
        "warranty_text_16": "Please refer to the Repair Terms and Conditions for the details on the Repair Services.",
        "linked_warranty_plan": "Linked Warranty Plan",
        "linked_warranty_regions": "*Regions include: Hong Kong, Macau, Taiwan, Singapore, Malaysia, India and Middle East countries",
        "linked_warranty_1": "Linked Warranty Plan enables customers who travel with, or relocate VAIO laptop to receive warranty service in any region where their product is announced and sold and supported by Nexstgo or a Nexstgo authorized reseller under Nexstgo Computer Limited Warranty and/or the destination region Warranty Services Agreement.",
        "linked_warranty_2" : "The length of Linked Warranty Plan is based upon the original warranty period assigned in the region of origin where the laptop was first sold by Nexstgo or a Nexstgo authorized reseller.",
        "linked_warranty_3" : "The phone support languages and the method of service will be determined by the destination region. For customers who have on-site repair warranty, on-site service will be delivered where it is available.",
        "linked_warranty_4" : "Some service and/or parts may not be available in all regions. Nexstgo or a Nexstgo authorized reseller may repair the laptop with comparable VAIO parts. For example, if the product was purchased with a Japanese keyboard, and service request is submitted in US, Nexstgo may replace with a US keyboard upon your agreement.",
        "linked_warranty_5" : "Some regions may have fees and restrictions that apply at the time of service such as packaging, shipping and handling fees. You will be advised of your responsibility to pay these fees at the time of service.",
        "linked_warranty_6" : "For VAIO products, if a customer has purchased warranty extension in the original region of hardware purchase to extend the Nexstgo base warranty offered with a product, Linked Warranty Plan will provide coverage until the end of purchased warranty extension.",
        "disclaimer_1": "Specifications may vary from country to country. Check with your local distributors or retailers for any updates on the current product.",
        "disclaimer_2": "Colors of actual products may differ from product shots due to photography lighting or display setting of your viewing device.",
        "disclaimer_3": "We try our best to provide accurate and complete product information online yet we reserve the rights to keep, change or correct any information without further notice."
    },
    "repair_tnc": {
        "repair_title": "Repair Terms & Conditions",
        "repair_text_1": "All support information on this site is limited to VAIO's personal computer products manufactured and sold by NEXSTGO. If your PC was manufactured by Sony Corporation, please visit Sony’s website for support.",
        "repair_text_2": "During the warranty period, the free-of-charge repair service for official Products of Nexstgo Company Limited (“NEXSTGO” or “Repair Service Centre”) shall be offered and subjected to these Repair Service Terms and Conditions and Limited Warranty Terms and Conditions.",
        "repair_text_3": "The NEXSTGO warranty service is applicable only in the country/region where you purchased your product.",
        "repair_text_4": "During the warranty period, no free of charge repair service shall be provided in the event of violation of any Repair Service Terms and Conditions. In this case repair charges shall be separately quoted by the Repair Service Centre or no repair service will be provided. Any self-repairs, damage done to the product or its accessories due to exposure to water, damage caused by misuse, cabinets/cosmetic damage, use in violation of instructions and alternation shall be considered as a violation of Repair Service Terms and Conditions.",
        "repair_text_5": "In addition to the necessary spare parts charges, a non-refundable service fee will be imposed in advance to all non-official products (i.e. parallel imports), out-of-warranty products, products with broken or missing identification label or where any violation of Repair Service Terms and Conditions being occurred. Repair Service Centre will inform the customer of an official quotation by phone or in writing in due course. All charges must be paid in full. We reserve the right to refuse repair service to end-of-life products or when parts become unavailable. For out-of-warranty products, Repair Service Center shall have the right to provide the same product, product upgrade or product discount to substitute product repair, and all charges must be paid in full by customer.",
        "repair_text_6": "Customer can enjoy warranty service provided that the products are purchased from authorized dealers and customer is required to present the original proof of purchase, which shall contain the full name of the dealer, date of purchase, invoice number, product model number, serial number (for applicable products), product price and dealer’s company chop.",
        "repair_text_7": "If the customer fails to present the original proof of purchase, the products will be treated as non-warranty products.",
        "repair_text_8": "NEXSTGO shall provide a one (1) month post-service warranty for the same serviced part (limited to same electrical and/or mechanical defect(s) under normal usage). You receive either the balance of your original hardware warranty or thirty calendar (30) days, whichever is longer.",
        "repair_text_9": "All changed defective parts, including but not limited to hard disk drive and memory, are non-returnable.",
        "repair_text_10": "Repair Service Centre shall not be responsible for any delay caused by the failure of communication with the customer. Customer is required to provide Repair Service Centre with valid contact number(s) and/or email address. If customer does not receive any pick up notification one (1) week after the drop off date, please contact Repair Service Centre by phone.",
        "repair_text_11": "Customer shall collect their product(s) within three (3) months after receipt of pick up notification from Repair Service Centre. Repair Service Centre shall not be responsible for any loss or damage to such products that left unclaimed after three (3) months. If the products are not collected within six (6) months, Repair Service Centre shall have the right to dispose of the products at its own discretion without any prior notice and compensation.",
        "repair_text_12": "The service order receipt should be kept as proof for collection of products. In the case of loss of receipt and products being taken by others, Repair Service Centre shall not be held responsible. If no original receipt is provided, Repair Service Centre shall have the right to refuse to return the products.",
        "repair_text_13": "Customer is responsible for the secure and back-up of all programs and data in a product. NEXSTGO shall not be responsible at any time for loss, alteration, or corruption of any software, program or data or files. For products delivered to and received by the Repair Service Centre, if customer requests for the return of their product after a notification for repair is issued, Repair Service Centre shall return the products (including a repair quotation where applicable) to customer in an as is condition.",
        "repair_text_14": "For products not covered by warranty, if customer is found to have violated any Repair Service Terms and Conditions (including but not limited to self-repairs, exposure to water, damage caused by misuse), Repair Service Centre shall have the right to provide to customer separate quotations based on actual defects found and reported.",
        "repair_text_15": "Repair Service Centre shall have the right to reject any unreasonable request for written or non-written report in relation to the repair service.",
        "repair_text_16": "The repair service of Repair Service Centre only applies to the Product hardware of the product(s). Accessories such as earphones, connecting cables, power cords, compact discs and DVDs, etc. are not applicable, unless otherwise stipulated.",
        "repair_text_17": "All data stored in electronics products may be lost or deleted after the repair. Before delivering any product to Repair Service Centre for repair service, customer should at their own costs (if any) create and keep by themselves a separate backup copy of customers’ data or information stored in the product(s) and disable any security passwords. Customer acknowledge and agree that data or information may be altered or deleted from the product(s) during repairs to which customer do not have any objection. Repair Service Centre shall not be responsible or liable for any data stored on the product(s) that is lost, altered, deleted, or is otherwise inaccessible after repair.",
        "repair_text_18": "Customer acknowledges and do not have any objection to the fact that Repair Service Centre does not warrant any uninterrupted or error-free operation of the product(s), and is not under any obligation to support the product(s) for all operating environment, including but not limited to, compatibility with all current and/or future versions of software or hardware, after the repairs.",
        "repair_text_19": "The warranty does not apply to any non-NEXSTGO hardware products, software and accessories.",
        "repair_text_20": "NEXSTGO reserves the right to interpret any terms and conditions set forth above in its sole and absolute discretion.",
        "repair_text_21": "Force majeure: NEXSTGO shall not be liable for any delay or failure to perform caused by or resulting from acts of God, fire, flood, accident, riot, war, government intervention, embargoes, strikes, labour difficulties or strikes, equipment failure, or any other causes beyond our control.",
        "repair_text_22": "We shall under no circumstances be liable for any loss (whether direct or indirect) of revenue, loss of profit or any indirect or consequential loss whatsoever suffered, sustained or incurred by you or by other person arising (directly or indirectly) out of or relating to the Service.",
        "repair_text_23": "The Company reserve the rights to modify, from time to time, all or any of the provisions under these Terms and Conditions. Please refer to NEXSTGO official website for the updated warranty policy and other applicable terms: http://www.nexstgo.com",
        "repair_text_24": "The Terms and Conditions shall be governed by the laws of the Hong Kong Special Administration Region and the Customer and We agree to submit to the exclusive jurisdiction of the Hong Kong courts.",
        "repair_text_25": "Should there be any inconsistency between Chinese and English versions, the English version shall prevail."
    },
    "about_us": {
        "image_about_us_banner": "/images/about_us/about_us_banner.png",
        "image_vaio": "/images/about_us/about_us_vaio.jpg",
        "image_nexst": "/images/about_us/about_us_nexstgo.jpg",
        "about_us_title": "About Us",
        "about_us_info": "June 4th, 2018, Nexstgo Company Limited announced that they will be licensed by VAIO Corporation to oversee the business in Asia. This license agreement between Hong Kong-based Nexstgo and the Japan-based VAIO Corporation will include manufacturing, sales and marketing as well as servicing of VAIO laptops under the VAIO trademark in the Hong Kong, Macau, Malaysia, Singapore, Taiwan, Middle East, and India markets.",
        "about_vaio_subtitle": "About VAIO Corporation",
        "about_vaio_subtext": "VAIO Corporation was established in July 1, 2014, spinning off from Sony’s PC business. With its headquarters and manufacturing base located in Azumino City, Nagano Prefecture, it is engaged in planning, design, development, manufacturing, sales and ancillary services in the PC business and EMS business.",
        "about_nexstgo_subtitle":"About Nexstgo Company Limited",
        "about_nexstgo_subtext": "Established in 2016, Nexstgo Company Limited is co-founded by Mr. Wilson Leung, CEO, Alco Holdings Limited (SEHK: 0328), and Mr. Alex Chung, out of a shared passion and pursuit of quality tech-innovation. Nexstgo is committed to bring new revolutionary experiences in technology through introducing a wide product range, which includes PC, Smart home, IoT, artificial intelligence and corporate solutions."
    },
    "contact_us": {
        "image_contact_us_banner": "/images/contact_us/contact_us.jpg",
        "image_email_icon": "/images/contact_us/email-icon.png",
        "contact_us_title": "Contact Us",
        "service_center": "Service Center",
        "customer_service": "Customer Service (HK)",
        "location": "-",
        "time": "-",
        "phone_number": "(Email reservation is required)",
        "email": "supporthk@hk.vaio.com",
        "general_inquiry_title": "General Enquiry",
        "general_inquiry_subtitle": "Email (General Enquiry)",
        "general_inquiry_email":"tw_support@vaio.com",
        "sales_inquiry_title": "Sales Enquiry",
        "sales_inquiry_times": "Operation Hours: 09:00-18:00 (Mon-Fri)",
        "sales_inquiry_subtitle": "Email",
        "sales_inquiry_email":"saleshk@hk.vaio.com"
    },
    "where_to_buy": {
        "image_email_icon": "/images/contact_us/email-icon.png",
        "sales_enquiry_title": "Sales Enquiry",
        "operation_hours": "Operation Hours: 09:00-18:00 (Mon-Fri)",
        "email_title": "Email",
        "email": "saleshk@hk.vaio.com"
    }
}